var questionnaireCitys = [
  {
    'id': 1001,
    'pid': 1,
    'name': '北京'
  },
  {
    'id': 1002,
    'pid': 2,
    'name': '上海'
  },
  {
    'id': 1003,
    'pid': 3,
    'name': '天津'
  },
  {
    'id': 1004,
    'pid': 4,
    'name': '重庆'
  },
  {
    'id': 1005,
    'pid': 5,
    'name': '石家庄'
  },
  {
    'id': 1006,
    'pid': 5,
    'name': '邯郸'
  },
  {
    'id': 1007,
    'pid': 5,
    'name': '邢台'
  },
  {
    'id': 1008,
    'pid': 5,
    'name': '保定'
  },
  {
    'id': 1009,
    'pid': 5,
    'name': '张家口'
  },
  {
    'id': 1010,
    'pid': 5,
    'name': '承德'
  },
  {
    'id': 1011,
    'pid': 5,
    'name': '廊坊'
  },
  {
    'id': 1012,
    'pid': 5,
    'name': '唐山'
  },
  {
    'id': 1013,
    'pid': 5,
    'name': '秦皇岛'
  },
  {
    'id': 1014,
    'pid': 5,
    'name': '沧州'
  },
  {
    'id': 1015,
    'pid': 5,
    'name': '衡水'
  },
  {
    'id': 1016,
    'pid': 6,
    'name': '太原'
  },
  {
    'id': 1017,
    'pid': 6,
    'name': '大同'
  },
  {
    'id': 1018,
    'pid': 6,
    'name': '阳泉'
  },
  {
    'id': 1019,
    'pid': 6,
    'name': '长治'
  },
  {
    'id': 1020,
    'pid': 6,
    'name': '晋城'
  },
  {
    'id': 1021,
    'pid': 6,
    'name': '朔州'
  },
  {
    'id': 1022,
    'pid': 6,
    'name': '吕梁'
  },
  {
    'id': 1023,
    'pid': 6,
    'name': '忻州'
  },
  {
    'id': 1024,
    'pid': 6,
    'name': '晋中'
  },
  {
    'id': 1025,
    'pid': 6,
    'name': '临汾'
  },
  {
    'id': 1026,
    'pid': 6,
    'name': '运城'
  },
  {
    'id': 1027,
    'pid': 7,
    'name': '呼和浩特'
  },
  {
    'id': 1028,
    'pid': 7,
    'name': '包头'
  },
  {
    'id': 1029,
    'pid': 7,
    'name': '乌海'
  },
  {
    'id': 1030,
    'pid': 7,
    'name': '赤峰'
  },
  {
    'id': 1031,
    'pid': 7,
    'name': '呼伦贝尔盟'
  },
  {
    'id': 1032,
    'pid': 7,
    'name': '阿拉善盟'
  },
  {
    'id': 1033,
    'pid': 7,
    'name': '哲里木盟'
  },
  {
    'id': 1034,
    'pid': 7,
    'name': '兴安盟'
  },
  {
    'id': 1035,
    'pid': 7,
    'name': '乌兰察布盟'
  },
  {
    'id': 1036,
    'pid': 7,
    'name': '锡林郭勒盟'
  },
  {
    'id': 1037,
    'pid': 7,
    'name': '巴彦淖尔盟'
  },
  {
    'id': 1038,
    'pid': 7,
    'name': '伊克昭盟'
  },
  {
    'id': 1039,
    'pid': 8,
    'name': '沈阳'
  },
  {
    'id': 1040,
    'pid': 8,
    'name': '大连'
  },
  {
    'id': 1041,
    'pid': 8,
    'name': '鞍山'
  },
  {
    'id': 1042,
    'pid': 8,
    'name': '抚顺'
  },
  {
    'id': 1043,
    'pid': 8,
    'name': '本溪'
  },
  {
    'id': 1044,
    'pid': 8,
    'name': '丹东'
  },
  {
    'id': 1045,
    'pid': 8,
    'name': '锦州'
  },
  {
    'id': 1046,
    'pid': 8,
    'name': '营口'
  },
  {
    'id': 1047,
    'pid': 8,
    'name': '阜新'
  },
  {
    'id': 1048,
    'pid': 8,
    'name': '辽阳'
  },
  {
    'id': 1049,
    'pid': 8,
    'name': '盘锦'
  },
  {
    'id': 1050,
    'pid': 8,
    'name': '铁岭'
  },
  {
    'id': 1051,
    'pid': 8,
    'name': '朝阳'
  },
  {
    'id': 1052,
    'pid': 8,
    'name': '葫芦岛'
  },
  {
    'id': 1053,
    'pid': 9,
    'name': '长春'
  },
  {
    'id': 1054,
    'pid': 9,
    'name': '吉林'
  },
  {
    'id': 1055,
    'pid': 9,
    'name': '四平'
  },
  {
    'id': 1056,
    'pid': 9,
    'name': '辽源'
  },
  {
    'id': 1057,
    'pid': 9,
    'name': '通化'
  },
  {
    'id': 1058,
    'pid': 9,
    'name': '白山'
  },
  {
    'id': 1059,
    'pid': 9,
    'name': '松原'
  },
  {
    'id': 1060,
    'pid': 9,
    'name': '白城'
  },
  {
    'id': 1061,
    'pid': 9,
    'name': '延边'
  },
  {
    'id': 1062,
    'pid': 10,
    'name': '哈尔滨'
  },
  {
    'id': 1063,
    'pid': 10,
    'name': '齐齐哈尔'
  },
  {
    'id': 1064,
    'pid': 10,
    'name': '牡丹江'
  },
  {
    'id': 1065,
    'pid': 10,
    'name': '佳木斯'
  },
  {
    'id': 1066,
    'pid': 10,
    'name': '大庆'
  },
  {
    'id': 1067,
    'pid': 10,
    'name': '绥化'
  },
  {
    'id': 1068,
    'pid': 10,
    'name': '鹤岗'
  },
  {
    'id': 1069,
    'pid': 10,
    'name': '鸡西'
  },
  {
    'id': 1070,
    'pid': 10,
    'name': '黑河'
  },
  {
    'id': 1071,
    'pid': 10,
    'name': '双鸭山'
  },
  {
    'id': 1072,
    'pid': 10,
    'name': '伊春'
  },
  {
    'id': 1073,
    'pid': 10,
    'name': '七台河'
  },
  {
    'id': 1074,
    'pid': 10,
    'name': '大兴安岭'
  },
  {
    'id': 1075,
    'pid': 11,
    'name': '南京'
  },
  {
    'id': 1076,
    'pid': 11,
    'name': '镇江'
  },
  {
    'id': 1077,
    'pid': 11,
    'name': '苏州'
  },
  {
    'id': 1078,
    'pid': 11,
    'name': '南通'
  },
  {
    'id': 1079,
    'pid': 11,
    'name': '扬州'
  },
  {
    'id': 1080,
    'pid': 11,
    'name': '盐城'
  },
  {
    'id': 1081,
    'pid': 11,
    'name': '徐州'
  },
  {
    'id': 1082,
    'pid': 11,
    'name': '连云港'
  },
  {
    'id': 1083,
    'pid': 11,
    'name': '常州'
  },
  {
    'id': 1084,
    'pid': 11,
    'name': '无锡'
  },
  {
    'id': 1085,
    'pid': 11,
    'name': '宿迁'
  },
  {
    'id': 1086,
    'pid': 11,
    'name': '泰州'
  },
  {
    'id': 1087,
    'pid': 11,
    'name': '淮安'
  },
  {
    'id': 1088,
    'pid': 12,
    'name': '杭州'
  },
  {
    'id': 1089,
    'pid': 12,
    'name': '宁波'
  },
  {
    'id': 1090,
    'pid': 12,
    'name': '温州'
  },
  {
    'id': 1091,
    'pid': 12,
    'name': '嘉兴'
  },
  {
    'id': 1092,
    'pid': 12,
    'name': '湖州'
  },
  {
    'id': 1093,
    'pid': 12,
    'name': '绍兴'
  },
  {
    'id': 1094,
    'pid': 12,
    'name': '金华'
  },
  {
    'id': 1095,
    'pid': 12,
    'name': '衢州'
  },
  {
    'id': 1096,
    'pid': 12,
    'name': '舟山'
  },
  {
    'id': 1097,
    'pid': 12,
    'name': '台州'
  },
  {
    'id': 1098,
    'pid': 12,
    'name': '丽水'
  },
  {
    'id': 1099,
    'pid': 13,
    'name': '合肥'
  },
  {
    'id': 1100,
    'pid': 13,
    'name': '芜湖'
  },
  {
    'id': 1101,
    'pid': 13,
    'name': '蚌埠'
  },
  {
    'id': 1102,
    'pid': 13,
    'name': '马鞍山'
  },
  {
    'id': 1103,
    'pid': 13,
    'name': '淮北'
  },
  {
    'id': 1104,
    'pid': 13,
    'name': '铜陵'
  },
  {
    'id': 1105,
    'pid': 13,
    'name': '安庆'
  },
  {
    'id': 1106,
    'pid': 13,
    'name': '黄山'
  },
  {
    'id': 1107,
    'pid': 13,
    'name': '滁州'
  },
  {
    'id': 1108,
    'pid': 13,
    'name': '宿州'
  },
  {
    'id': 1109,
    'pid': 13,
    'name': '池州'
  },
  {
    'id': 1110,
    'pid': 13,
    'name': '淮南'
  },
  {
    'id': 1111,
    'pid': 13,
    'name': '巢湖'
  },
  {
    'id': 1112,
    'pid': 13,
    'name': '阜阳'
  },
  {
    'id': 1113,
    'pid': 13,
    'name': '六安'
  },
  {
    'id': 1114,
    'pid': 13,
    'name': '宣城'
  },
  {
    'id': 1115,
    'pid': 13,
    'name': '亳州'
  },
  {
    'id': 1116,
    'pid': 14,
    'name': '福州'
  },
  {
    'id': 1117,
    'pid': 14,
    'name': '厦门'
  },
  {
    'id': 1118,
    'pid': 14,
    'name': '莆田'
  },
  {
    'id': 1119,
    'pid': 14,
    'name': '三明'
  },
  {
    'id': 1120,
    'pid': 14,
    'name': '泉州'
  },
  {
    'id': 1121,
    'pid': 14,
    'name': '漳州'
  },
  {
    'id': 1122,
    'pid': 14,
    'name': '南平'
  },
  {
    'id': 1123,
    'pid': 14,
    'name': '龙岩'
  },
  {
    'id': 1124,
    'pid': 14,
    'name': '宁德'
  },
  {
    'id': 1125,
    'pid': 15,
    'name': '南昌市'
  },
  {
    'id': 1126,
    'pid': 15,
    'name': '景德镇'
  },
  {
    'id': 1127,
    'pid': 15,
    'name': '九江'
  },
  {
    'id': 1128,
    'pid': 15,
    'name': '鹰潭'
  },
  {
    'id': 1129,
    'pid': 15,
    'name': '萍乡'
  },
  {
    'id': 1130,
    'pid': 15,
    'name': '新馀'
  },
  {
    'id': 1131,
    'pid': 15,
    'name': '赣州'
  },
  {
    'id': 1132,
    'pid': 15,
    'name': '吉安'
  },
  {
    'id': 1133,
    'pid': 15,
    'name': '宜春'
  },
  {
    'id': 1134,
    'pid': 15,
    'name': '抚州'
  },
  {
    'id': 1135,
    'pid': 15,
    'name': '上饶'
  },
  {
    'id': 1136,
    'pid': 16,
    'name': '济南'
  },
  {
    'id': 1137,
    'pid': 16,
    'name': '青岛'
  },
  {
    'id': 1138,
    'pid': 16,
    'name': '淄博'
  },
  {
    'id': 1139,
    'pid': 16,
    'name': '枣庄'
  },
  {
    'id': 1140,
    'pid': 16,
    'name': '东营'
  },
  {
    'id': 1141,
    'pid': 16,
    'name': '烟台'
  },
  {
    'id': 1142,
    'pid': 16,
    'name': '潍坊'
  },
  {
    'id': 1143,
    'pid': 16,
    'name': '济宁'
  },
  {
    'id': 1144,
    'pid': 16,
    'name': '泰安'
  },
  {
    'id': 1145,
    'pid': 16,
    'name': '威海'
  },
  {
    'id': 1146,
    'pid': 16,
    'name': '日照'
  },
  {
    'id': 1147,
    'pid': 16,
    'name': '莱芜'
  },
  {
    'id': 1148,
    'pid': 16,
    'name': '临沂'
  },
  {
    'id': 1149,
    'pid': 16,
    'name': '德州'
  },
  {
    'id': 1150,
    'pid': 16,
    'name': '聊城'
  },
  {
    'id': 1151,
    'pid': 16,
    'name': '滨州'
  },
  {
    'id': 1152,
    'pid': 16,
    'name': '菏泽'
  },
  {
    'id': 1153,
    'pid': 17,
    'name': '郑州'
  },
  {
    'id': 1154,
    'pid': 17,
    'name': '开封'
  },
  {
    'id': 1155,
    'pid': 17,
    'name': '洛阳'
  },
  {
    'id': 1156,
    'pid': 17,
    'name': '平顶山'
  },
  {
    'id': 1157,
    'pid': 17,
    'name': '安阳'
  },
  {
    'id': 1158,
    'pid': 17,
    'name': '鹤壁'
  },
  {
    'id': 1159,
    'pid': 17,
    'name': '新乡'
  },
  {
    'id': 1160,
    'pid': 17,
    'name': '焦作'
  },
  {
    'id': 1161,
    'pid': 17,
    'name': '濮阳'
  },
  {
    'id': 1162,
    'pid': 17,
    'name': '许昌'
  },
  {
    'id': 1163,
    'pid': 17,
    'name': '漯河'
  },
  {
    'id': 1164,
    'pid': 17,
    'name': '三门峡'
  },
  {
    'id': 1165,
    'pid': 17,
    'name': '南阳'
  },
  {
    'id': 1166,
    'pid': 17,
    'name': '商丘'
  },
  {
    'id': 1167,
    'pid': 17,
    'name': '信阳'
  },
  {
    'id': 1168,
    'pid': 17,
    'name': '周口'
  },
  {
    'id': 1169,
    'pid': 17,
    'name': '驻马店'
  },
  {
    'id': 1170,
    'pid': 17,
    'name': '济源'
  },
  {
    'id': 1171,
    'pid': 18,
    'name': '武汉'
  },
  {
    'id': 1172,
    'pid': 18,
    'name': '宜昌'
  },
  {
    'id': 1173,
    'pid': 18,
    'name': '荆州'
  },
  {
    'id': 1174,
    'pid': 18,
    'name': '襄樊'
  },
  {
    'id': 1175,
    'pid': 18,
    'name': '黄石'
  },
  {
    'id': 1176,
    'pid': 18,
    'name': '荆门'
  },
  {
    'id': 1177,
    'pid': 18,
    'name': '黄冈'
  },
  {
    'id': 1178,
    'pid': 18,
    'name': '十堰'
  },
  {
    'id': 1179,
    'pid': 18,
    'name': '恩施'
  },
  {
    'id': 1180,
    'pid': 18,
    'name': '潜江'
  },
  {
    'id': 1181,
    'pid': 18,
    'name': '天门'
  },
  {
    'id': 1182,
    'pid': 18,
    'name': '仙桃'
  },
  {
    'id': 1183,
    'pid': 18,
    'name': '随州'
  },
  {
    'id': 1184,
    'pid': 18,
    'name': '咸宁'
  },
  {
    'id': 1185,
    'pid': 18,
    'name': '孝感'
  },
  {
    'id': 1186,
    'pid': 18,
    'name': '鄂州'
  },
  {
    'id': 1187,
    'pid': 19,
    'name': '长沙'
  },
  {
    'id': 1188,
    'pid': 19,
    'name': '常德'
  },
  {
    'id': 1189,
    'pid': 19,
    'name': '株洲'
  },
  {
    'id': 1190,
    'pid': 19,
    'name': '湘潭'
  },
  {
    'id': 1191,
    'pid': 19,
    'name': '衡阳'
  },
  {
    'id': 1192,
    'pid': 19,
    'name': '岳阳'
  },
  {
    'id': 1193,
    'pid': 19,
    'name': '邵阳'
  },
  {
    'id': 1194,
    'pid': 19,
    'name': '益阳'
  },
  {
    'id': 1195,
    'pid': 19,
    'name': '娄底'
  },
  {
    'id': 1196,
    'pid': 19,
    'name': '怀化'
  },
  {
    'id': 1197,
    'pid': 19,
    'name': '郴州'
  },
  {
    'id': 1198,
    'pid': 19,
    'name': '永州'
  },
  {
    'id': 1199,
    'pid': 19,
    'name': '湘西'
  },
  {
    'id': 1200,
    'pid': 19,
    'name': '张家界'
  },
  {
    'id': 1201,
    'pid': 20,
    'name': '广州'
  },
  {
    'id': 1202,
    'pid': 20,
    'name': '深圳'
  },
  {
    'id': 1203,
    'pid': 20,
    'name': '珠海'
  },
  {
    'id': 1204,
    'pid': 20,
    'name': '汕头'
  },
  {
    'id': 1205,
    'pid': 20,
    'name': '东莞'
  },
  {
    'id': 1206,
    'pid': 20,
    'name': '中山'
  },
  {
    'id': 1207,
    'pid': 20,
    'name': '佛山'
  },
  {
    'id': 1208,
    'pid': 20,
    'name': '韶关'
  },
  {
    'id': 1209,
    'pid': 20,
    'name': '江门'
  },
  {
    'id': 1210,
    'pid': 20,
    'name': '湛江'
  },
  {
    'id': 1211,
    'pid': 20,
    'name': '茂名'
  },
  {
    'id': 1212,
    'pid': 20,
    'name': '肇庆'
  },
  {
    'id': 1213,
    'pid': 20,
    'name': '惠州'
  },
  {
    'id': 1214,
    'pid': 20,
    'name': '梅州'
  },
  {
    'id': 1215,
    'pid': 20,
    'name': '汕尾'
  },
  {
    'id': 1216,
    'pid': 20,
    'name': '河源'
  },
  {
    'id': 1217,
    'pid': 20,
    'name': '阳江'
  },
  {
    'id': 1218,
    'pid': 20,
    'name': '清远'
  },
  {
    'id': 1219,
    'pid': 20,
    'name': '潮州'
  },
  {
    'id': 1220,
    'pid': 20,
    'name': '揭阳'
  },
  {
    'id': 1221,
    'pid': 20,
    'name': '云浮'
  },
  {
    'id': 1222,
    'pid': 21,
    'name': '南宁'
  },
  {
    'id': 1223,
    'pid': 21,
    'name': '柳州'
  },
  {
    'id': 1224,
    'pid': 21,
    'name': '桂林'
  },
  {
    'id': 1225,
    'pid': 21,
    'name': '梧州'
  },
  {
    'id': 1226,
    'pid': 21,
    'name': '北海'
  },
  {
    'id': 1227,
    'pid': 21,
    'name': '防城港'
  },
  {
    'id': 1228,
    'pid': 21,
    'name': '钦州'
  },
  {
    'id': 1229,
    'pid': 21,
    'name': '贵港'
  },
  {
    'id': 1230,
    'pid': 21,
    'name': '玉林'
  },
  {
    'id': 1231,
    'pid': 21,
    'name': '南宁地区'
  },
  {
    'id': 1232,
    'pid': 21,
    'name': '柳州地区'
  },
  {
    'id': 1233,
    'pid': 21,
    'name': '贺州'
  },
  {
    'id': 1234,
    'pid': 21,
    'name': '百色'
  },
  {
    'id': 1235,
    'pid': 21,
    'name': '河池'
  },
  {
    'id': 1236,
    'pid': 22,
    'name': '海口'
  },
  {
    'id': 1237,
    'pid': 22,
    'name': '三亚'
  },
  {
    'id': 1238,
    'pid': 23,
    'name': '成都'
  },
  {
    'id': 1239,
    'pid': 23,
    'name': '绵阳'
  },
  {
    'id': 1240,
    'pid': 23,
    'name': '德阳'
  },
  {
    'id': 1241,
    'pid': 23,
    'name': '自贡'
  },
  {
    'id': 1242,
    'pid': 23,
    'name': '攀枝花'
  },
  {
    'id': 1243,
    'pid': 23,
    'name': '广元'
  },
  {
    'id': 1244,
    'pid': 23,
    'name': '内江'
  },
  {
    'id': 1245,
    'pid': 23,
    'name': '乐山'
  },
  {
    'id': 1246,
    'pid': 23,
    'name': '南充'
  },
  {
    'id': 1247,
    'pid': 23,
    'name': '宜宾'
  },
  {
    'id': 1248,
    'pid': 23,
    'name': '广安'
  },
  {
    'id': 1249,
    'pid': 23,
    'name': '达川'
  },
  {
    'id': 1250,
    'pid': 23,
    'name': '雅安'
  },
  {
    'id': 1251,
    'pid': 23,
    'name': '眉山'
  },
  {
    'id': 1252,
    'pid': 23,
    'name': '甘孜'
  },
  {
    'id': 1253,
    'pid': 23,
    'name': '凉山'
  },
  {
    'id': 1254,
    'pid': 23,
    'name': '泸州'
  },
  {
    'id': 1255,
    'pid': 24,
    'name': '贵阳'
  },
  {
    'id': 1256,
    'pid': 24,
    'name': '六盘水'
  },
  {
    'id': 1257,
    'pid': 24,
    'name': '遵义'
  },
  {
    'id': 1258,
    'pid': 24,
    'name': '安顺'
  },
  {
    'id': 1259,
    'pid': 24,
    'name': '铜仁'
  },
  {
    'id': 1260,
    'pid': 24,
    'name': '黔西南'
  },
  {
    'id': 1261,
    'pid': 24,
    'name': '毕节'
  },
  {
    'id': 1262,
    'pid': 24,
    'name': '黔东南'
  },
  {
    'id': 1263,
    'pid': 24,
    'name': '黔南'
  },
  {
    'id': 1264,
    'pid': 25,
    'name': '昆明'
  },
  {
    'id': 1265,
    'pid': 25,
    'name': '大理'
  },
  {
    'id': 1266,
    'pid': 25,
    'name': '曲靖'
  },
  {
    'id': 1267,
    'pid': 25,
    'name': '玉溪'
  },
  {
    'id': 1268,
    'pid': 25,
    'name': '昭通'
  },
  {
    'id': 1269,
    'pid': 25,
    'name': '楚雄'
  },
  {
    'id': 1270,
    'pid': 25,
    'name': '红河'
  },
  {
    'id': 1271,
    'pid': 25,
    'name': '文山'
  },
  {
    'id': 1272,
    'pid': 25,
    'name': '思茅'
  },
  {
    'id': 1273,
    'pid': 25,
    'name': '西双版纳'
  },
  {
    'id': 1274,
    'pid': 25,
    'name': '保山'
  },
  {
    'id': 1275,
    'pid': 25,
    'name': '德宏'
  },
  {
    'id': 1276,
    'pid': 25,
    'name': '丽江'
  },
  {
    'id': 1277,
    'pid': 25,
    'name': '怒江'
  },
  {
    'id': 1278,
    'pid': 25,
    'name': '迪庆'
  },
  {
    'id': 1279,
    'pid': 25,
    'name': '临沧'
  },
  {
    'id': 1280,
    'pid': 26,
    'name': '拉萨'
  },
  {
    'id': 1281,
    'pid': 26,
    'name': '日喀则'
  },
  {
    'id': 1282,
    'pid': 26,
    'name': '山南'
  },
  {
    'id': 1283,
    'pid': 26,
    'name': '林芝'
  },
  {
    'id': 1284,
    'pid': 26,
    'name': '昌都'
  },
  {
    'id': 1285,
    'pid': 26,
    'name': '阿里'
  },
  {
    'id': 1286,
    'pid': 26,
    'name': '那曲'
  },
  {
    'id': 1287,
    'pid': 27,
    'name': '西安'
  },
  {
    'id': 1288,
    'pid': 27,
    'name': '宝鸡'
  },
  {
    'id': 1289,
    'pid': 27,
    'name': '咸阳'
  },
  {
    'id': 1290,
    'pid': 27,
    'name': '铜川'
  },
  {
    'id': 1291,
    'pid': 27,
    'name': '渭南'
  },
  {
    'id': 1292,
    'pid': 27,
    'name': '延安'
  },
  {
    'id': 1293,
    'pid': 27,
    'name': '榆林'
  },
  {
    'id': 1294,
    'pid': 27,
    'name': '汉中'
  },
  {
    'id': 1295,
    'pid': 27,
    'name': '安康'
  },
  {
    'id': 1296,
    'pid': 27,
    'name': '商洛'
  },
  {
    'id': 1297,
    'pid': 28,
    'name': '兰州'
  },
  {
    'id': 1298,
    'pid': 28,
    'name': '嘉峪关'
  },
  {
    'id': 1299,
    'pid': 28,
    'name': '金昌'
  },
  {
    'id': 1300,
    'pid': 28,
    'name': '白银'
  },
  {
    'id': 1301,
    'pid': 28,
    'name': '天水'
  },
  {
    'id': 1302,
    'pid': 28,
    'name': '酒泉'
  },
  {
    'id': 1303,
    'pid': 28,
    'name': '张掖'
  },
  {
    'id': 1304,
    'pid': 28,
    'name': '武威'
  },
  {
    'id': 1305,
    'pid': 28,
    'name': '定西'
  },
  {
    'id': 1306,
    'pid': 28,
    'name': '陇南'
  },
  {
    'id': 1307,
    'pid': 28,
    'name': '平凉'
  },
  {
    'id': 1308,
    'pid': 28,
    'name': '庆阳'
  },
  {
    'id': 1309,
    'pid': 28,
    'name': '临夏'
  },
  {
    'id': 1310,
    'pid': 28,
    'name': '甘南'
  },
  {
    'id': 1311,
    'pid': 29,
    'name': '银川'
  },
  {
    'id': 1312,
    'pid': 29,
    'name': '石嘴山'
  },
  {
    'id': 1313,
    'pid': 29,
    'name': '吴忠'
  },
  {
    'id': 1314,
    'pid': 29,
    'name': '固原'
  },
  {
    'id': 1315,
    'pid': 30,
    'name': '西宁'
  },
  {
    'id': 1316,
    'pid': 30,
    'name': '海东'
  },
  {
    'id': 1317,
    'pid': 30,
    'name': '海南'
  },
  {
    'id': 1318,
    'pid': 30,
    'name': '海北'
  },
  {
    'id': 1319,
    'pid': 30,
    'name': '黄南'
  },
  {
    'id': 1320,
    'pid': 30,
    'name': '玉树'
  },
  {
    'id': 1321,
    'pid': 30,
    'name': '果洛'
  },
  {
    'id': 1322,
    'pid': 30,
    'name': '海西'
  },
  {
    'id': 1323,
    'pid': 31,
    'name': '乌鲁木齐'
  },
  {
    'id': 1324,
    'pid': 31,
    'name': '石河子'
  },
  {
    'id': 1325,
    'pid': 31,
    'name': '克拉玛依'
  },
  {
    'id': 1326,
    'pid': 31,
    'name': '伊犁'
  },
  {
    'id': 1327,
    'pid': 31,
    'name': '巴音郭勒'
  },
  {
    'id': 1328,
    'pid': 31,
    'name': '昌吉'
  },
  {
    'id': 1329,
    'pid': 31,
    'name': '克孜勒苏柯尔克孜'
  },
  {
    'id': 1330,
    'pid': 31,
    'name': '博 尔塔拉'
  },
  {
    'id': 1331,
    'pid': 31,
    'name': '吐鲁番'
  },
  {
    'id': 1332,
    'pid': 31,
    'name': '哈密'
  },
  {
    'id': 1333,
    'pid': 31,
    'name': '喀什'
  },
  {
    'id': 1334,
    'pid': 31,
    'name': '和田'
  },
  {
    'id': 1335,
    'pid': 31,
    'name': '阿克苏'
  },
  {
    'id': 1336,
    'pid': 32,
    'name': '香港'
  },
  {
    'id': 1337,
    'pid': 33,
    'name': '澳门'
  },
  {
    'id': 1338,
    'pid': 34,
    'name': '台北'
  },
  {
    'id': 1339,
    'pid': 34,
    'name': '高雄'
  },
  {
    'id': 1340,
    'pid': 34,
    'name': '台中'
  },
  {
    'id': 1341,
    'pid': 34,
    'name': '台南'
  },
  {
    'id': 1342,
    'pid': 34,
    'name': '屏东'
  },
  {
    'id': 1343,
    'pid': 34,
    'name': '南投'
  },
  {
    'id': 1344,
    'pid': 34,
    'name': '云林'
  },
  {
    'id': 1345,
    'pid': 34,
    'name': '新竹'
  },
  {
    'id': 1346,
    'pid': 34,
    'name': '彰化'
  },
  {
    'id': 1347,
    'pid': 34,
    'name': '苗栗'
  },
  {
    'id': 1348,
    'pid': 34,
    'name': '嘉义'
  },
  {
    'id': 1349,
    'pid': 34,
    'name': '花莲'
  },
  {
    'id': 1350,
    'pid': 34,
    'name': '桃园'
  },
  {
    'id': 1351,
    'pid': 34,
    'name': '宜兰'
  },
  {
    'id': 1352,
    'pid': 34,
    'name': '基隆'
  },
  {
    'id': 1353,
    'pid': 34,
    'name': '台东'
  },
  {
    'id': 1354,
    'pid': 34,
    'name': '金门'
  },
  {
    'id': 1355,
    'pid': 34,
    'name': '马祖'
  },
  {
    'id': 1356,
    'pid': 34,
    'name': '澎湖'
  },
  {
    'id': 1357,
    'pid': 35,
    'name': '海外'
  }

]
export default questionnaireCitys
